In [18]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
%matplotlib inline

In [94]:
df=pd.read_csv('House_Rent_Dataset.csv')

In [95]:
df

,Posted On,BHK,Rent,Size,Floor,Area Type,Area Locality,City,Furnishing Status,Tenant Preferred,Bathroom,Point of Contact
0,2022-05-18,2,10000,1100,Ground out of 2,Super Area,Bandel,Kolkata,Unfurnished,Bachelors/Family,2,Contact Owner
1,2022-05-13,2,20000,800,1 out of 3,Super Area,"Phool Bagan, Kankurgachi",Kolkata,Semi-Furnished,Bachelors/Family,1,Contact Owner
2,2022-05-16,2,17000,1000,1 out of 3,Super Area,Salt Lake City Sector 2,Kolkata,Semi-Furnished,Bachelors/Family,1,Contact Owner
3,2022-07-04,2,10000,800,1 out of 2,Super Area,Dumdum Park,Kolkata,Unfurnished,Bachelors/Family,1,Contact Owner
4,2022-05-09,2,7500,850,1 out of 2,Carpet Area,South Dum Dum,Kolkata,Unfurnished,Bachelors,1,Contact Owner
...,...,...,...,...,...,...,...,...,...,...,...,...
4741,2022-05-18,2,15000,1000,3 out of 5,Carpet Area,Bandam Kommu,Hyderabad,Semi-Furnished,Bachelors/Family,2,Contact Owner
4742,2022-05-15,3,29000,2000,1 out of 4,Super Area,"Manikonda, Hyderabad",Hyderabad,Semi-Furnished,Bachelors/Family,3,Contact Owner
4743,2022-07-10,3,35000,1750,3 out of 5,Carpet Area,"Himayath Nagar, NH 7",Hyderabad,Semi-Furnished,Bachelors/Family,3,Contact Agent
4744,2022-07-06,3,45000,1500,23 out of 34,Carpet Area,Gachibowli,Hyderabad,Semi-Furnished,Family,2,Contact Agent
4745,2022-05-04,2,15000,1000,4 out of 5,Carpet Area,Suchitra Circle,Hyderabad,Unfurnished,Bachelors,2,Contact Owner

In [96]:
df.head()

,Posted On,BHK,Rent,Size,Floor,Area Type,Area Locality,City,Furnishing Status,Tenant Preferred,Bathroom,Point of Contact
0,2022-05-18,2,10000,1100,Ground out of 2,Super Area,Bandel,Kolkata,Unfurnished,Bachelors/Family,2,Contact Owner
1,2022-05-13,2,20000,800,1 out of 3,Super Area,"Phool Bagan, Kankurgachi",Kolkata,Semi-Furnished,Bachelors/Family,1,Contact Owner
2,2022-05-16,2,17000,1000,1 out of 3,Super Area,Salt Lake City Sector 2,Kolkata,Semi-Furnished,Bachelors/Family,1,Contact Owner
3,2022-07-04,2,10000,800,1 out of 2,Super Area,Dumdum Park,Kolkata,Unfurnished,Bachelors/Family,1,Contact Owner
4,2022-05-09,2,7500,850,1 out of 2,Carpet Area,South Dum Dum,Kolkata,Unfurnished,Bachelors,1,Contact Owner

In [97]:
df.drop(['Posted On', 'Floor', 'Area Type',
       'Area Locality', 'Furnishing Status', 'Tenant Preferred','Point of Contact'],axis=1,inplace=True)
# df.drop(['day','month','year'],axis=1,inplace=True)

In [38]:
df.columns

Index(['BHK', 'Rent', 'Size', 'City', 'Bathroom'], dtype='object')

In [98]:
df.columns=df.columns.str.strip()

In [99]:
df.columns

Index(['BHK', 'Rent', 'Size', 'City', 'Bathroom'], dtype='object')

In [40]:
df

      BHK   Rent  Size       City  Bathroom
0       2  10000  1100    Kolkata         2
1       2  20000   800    Kolkata         1
2       2  17000  1000    Kolkata         1
3       2  10000   800    Kolkata         1
4       2   7500   850    Kolkata         1
...   ...    ...   ...        ...       ...
4741    2  15000  1000  Hyderabad         2
4742    3  29000  2000  Hyderabad         3
4743    3  35000  1750  Hyderabad         3
4744    3  45000  1500  Hyderabad         2
4745    2  15000  1000  Hyderabad         2

[4746 rows x 5 columns]

In [100]:
df['City'].value_counts()

City
Mumbai       972
Chennai      891
Bangalore    886
Hyderabad    868
Delhi        605
Kolkata      524
Name: count, dtype: int64

In [101]:
df['City']=df['City'].map({'Mumbai':1,'Chennai':2,'Bangalore':3,'Hyderabad':4,'Delhi':5,'Kolkata':6})

In [102]:
df.isnull().sum()

BHK         0
Rent        0
Size        0
City        0
Bathroom    0
dtype: int64

In [103]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4746 entries, 0 to 4745
Data columns (total 5 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   BHK       4746 non-null   int64
 1   Rent      4746 non-null   int64
 2   Size      4746 non-null   int64
 3   City      4746 non-null   int64
 4   Bathroom  4746 non-null   int64
dtypes: int64(5)
memory usage: 185.5 KB

In [48]:
df.corr()

               BHK      Rent      Size      City  Bathroom
BHK       1.000000  0.369718  0.716145 -0.023944  0.794885
Rent      0.369718  1.000000  0.413551 -0.234468  0.441215
Size      0.716145  0.413551  1.000000 -0.050796  0.740703
City     -0.023944 -0.234468 -0.050796  1.000000 -0.214738
Bathroom  0.794885  0.441215  0.740703 -0.214738  1.000000

In [124]:
df.to_csv('carcleandata.csv')

In [50]:
df.columns

Index(['BHK', 'Rent', 'Size', 'City', 'Bathroom'], dtype='object')

In [104]:
x=df[['BHK','Size','City','Bathroom']]
y=df['Rent']

In [105]:
from sklearn.model_selection import train_test_split

In [106]:
xtrain,xtest,ytrain,ytest=train_test_split(x,y,test_size=0.25,random_state=42)

In [107]:
xtrain

      BHK  Size  City  Bathroom
1196    2  1300     1         2
2215    2   630     3         2
1598    1   600     3         1
1532    2  1045     3         2
1501    2   600     3         1
...   ...   ...   ...       ...
4426    3  1500     4         3
466     3  1200     6         2
3092    2   800     2         2
3772    3  3500     2         3
860     1   450     1         2

[3559 rows x 4 columns]

In [60]:
def correlation(dataset, threshold):
    col_corr = set()
    corr_matrix = dataset.corr()
    for i in range(len(corr_matrix.columns)):
        for j in range(i):
            if abs(corr_matrix.iloc[i, j]) > threshold:
                colname = corr_matrix.columns[i]
                col_corr.add(colname)
    return col_corr

In [63]:
corr_features=correlation(xtrain,0.85)
corr_features

set()

In [59]:
from sklearn.preprocessing import StandardScaler
scaler=StandardScaler()
xtrain_scaled=scaler.fit_transform(xtrain)
xtest_scaled=scaler.transform(xtest)

In [108]:
#linear regression
from sklearn.linear_model import LinearRegression
from sklearn.metrics import mean_absolute_error
from sklearn.metrics import r2_score

regressor=LinearRegression()
regressor.fit(xtrain,ytrain)
ypred=regressor.predict(xtest)
mae=mean_absolute_error(ytest,ypred)
score=r2_score(ytest,ypred)
print("Mean absolute error", mae)
print("R2 Score", score)

Mean absolute error 25763.48949994917
R2 Score 0.4116812310431911

In [118]:
#lasso regression
from sklearn.linear_model import Lasso
from sklearn.metrics import mean_absolute_error
from sklearn.metrics import r2_score

lasso=Lasso()
lasso.fit(xtrain,ytrain)
ypred=lasso.predict(xtest)
mae=mean_absolute_error(ytest,ypred)
score=r2_score(ytest,ypred)
print("Mean absolute error", mae)
print("R2 Score", score)

Mean absolute error 25763.173673854515
R2 Score 0.4116838523862061

In [119]:
#elasticnet regression
from sklearn.linear_model import Ridge
from sklearn.metrics import mean_absolute_error
from sklearn.metrics import r2_score

ridge=Ridge()
ridge.fit(xtrain,ytrain)
ypred=ridge.predict(xtest)
mae=mean_absolute_error(ytest,ypred)
score=r2_score(ytest,ypred)
print("Mean absolute error", mae)
print("R2 Score", score)

Mean absolute error 25762.734539512563
R2 Score 0.4116857187069449

In [120]:
#ridge regression
from sklearn.linear_model import ElasticNet
from sklearn.metrics import mean_absolute_error
from sklearn.metrics import r2_score

elastic=ElasticNet()
elastic.fit(xtrain,ytrain)
ypred=elastic.predict(xtest)
mae=mean_absolute_error(ytest,ypred)
score=r2_score(ytest,ypred)
print("Mean absolute error", mae)
print("R2 Score", score)

Mean absolute error 25315.64895333447
R2 Score 0.4060952502570988

In [115]:
# scaler.transform()

In [116]:
# a=[2,11000,6,2]
# a=scaler.transform([2,11000,6,2])

In [117]:
# regressor.predict([[a]])

In [68]:
df

      BHK   Rent  Size  City  Bathroom
0       2  10000  1100     6         2
1       2  20000   800     6         1
2       2  17000  1000     6         1
3       2  10000   800     6         1
4       2   7500   850     6         1
...   ...    ...   ...   ...       ...
4741    2  15000  1000     4         2
4742    3  29000  2000     4         3
4743    3  35000  1750     4         3
4744    3  45000  1500     4         2
4745    2  15000  1000     4         2

[4746 rows x 5 columns]

In [122]:
regressor.predict([[1,1100,6,2]])

C:\Users\syeds\anaconda3\Lib\site-packages\sklearn\base.py:464: UserWarning: X does not have valid feature names, but LinearRegression was fitted with feature names
  warnings.warn(

array([8490.86500052])

In [114]:
import pickle

In [123]:

pickle.dump(ridge,open('carridge.pkl','wb'))